documents/images/graphio/stdlib/convert_vector2_shader_instance.dot
digraph {
  rankdir = LR;
    NG_convert_vector2_shader_surface [label= "surface_unlit"];
    NG_convert_vector2_shader_surface[shape = box];
    NG_convert_vector2_shader_surface ->     NG_convert_vector2_shader_out;
    NG_convert_vector2_shader_out [label= "out"];
    NG_convert_vector2_shader_out[shape = box]; 
    NG_convert_vector2_shader_vec3_to_color3 [label= "convert"];
    NG_convert_vector2_shader_vec3_to_color3[shape = box];
    NG_convert_vector2_shader_vec3_to_color3 ->     NG_convert_vector2_shader_surface [label= "emission_color"];
    NG_convert_vector2_shader_surface [label= "surface_unlit"];
    NG_convert_vector2_shader_surface[shape = box]; 
    NG_convert_vector2_shader_vec2_to_vec3 [label= "convert"];
    NG_convert_vector2_shader_vec2_to_vec3[shape = box];
    NG_convert_vector2_shader_vec2_to_vec3 ->     NG_convert_vector2_shader_vec3_to_color3 [label= "in"];
    NG_convert_vector2_shader_vec3_to_color3 [label= "convert"];
    NG_convert_vector2_shader_vec3_to_color3[shape = box]; 
    NG_convert_vector2_shader_inINT [label="in"];
    NG_convert_vector2_shader_inINT [shape = ellipse];
    NG_convert_vector2_shader_vec2_to_vec3 [label="convert"];
    NG_convert_vector2_shader_inINT -> NG_convert_vector2_shader_vec2_to_vec3 [label=".in"];
}
